<h1>7.1 開発の流れ</h1>
<h2>7.1.1 フレームワークとは</h2>
<p>フレームワーク: アプリケーションの土台となるライブラリ</p>
<p>フレームワークを使った開発: アプリケーションの基本的な流れが最初から出来上がっており、その流れの中に必要に合わせて処理を組み込んでいく</p>

<h2>7.1.2 開発効率の向上</h2>
<p>PHPは元々個人向けWebサイトを作成するために作成された。</p>
<p>特にビジネスでは開発効率やメンテナンス性が重要視され、それらを向上させるためには役割に応じて機能を分割したりする必要がある。ここで登場するのがフレームワーク。</p>

<h2>7.1.3 フレームワークとオブジェクト指向</h2>
<p>オブジェクト指向: 様々な機能などをオブジェクトと呼ばれるまとまりとして扱う手法。</p>
<p>公開されているフレームワークのほとんどはオブジェクト指向で記述されている。オブジェクトの差し替えや継承を行うことでフレームワークの拡張も可能になる。作りたいアプリケーションに必要なロジック（これをビジネスロジックと呼ぶ）を記述する際も、基本的な機能をまとめたオブジェクトを継承することで開発がぐっと楽になる。</p>

